print(5) # Функция вывода(печати)
print(5, 5, 7, 2)

a = 2333 # Присвоение значения переменной
print(a)

str1 = 'Football'
print(str1)

# Функция для определения типа данных у переменной "type"
n = 2
print(type(n))
n1 = 'hi, my lord'
print(type(n1))

# Печать нескольких переменных с разделителями
a = 1
b = 2.34
c = "given"

print(f"{a} - {b} - {c}")
print(f"{a} , {b} , {c}")
print("{} - {} - {}".format(a, b, c))

# Пример ввода данных

print('Введите первое значение: ')
a = input()
print("Полученный результат: ", a)

b = input('Введите второе число: ')
c = ("Полученный результат: ")
print(c, b)