# print(5) # Функция вывода(печати)
# print(5, 5, 7, 2)

# a = 2333 # Присвоение значения переменной
# print(a)

# str1 = 'Football'
# print(str1)

# # Функция для определения типа данных у переменной "type"

# n = 2
# print(type(n))
# n1 = 'hi, my lord'
# print(type(n1))

# # Печать нескольких переменных с разделителями

# a = 1
# b = 2.34
# c = "given"

# print(f"{a} - {b} - {c}")
# print(f"{a} , {b} , {c}")
# print("{} - {} - {}".format(a, b, c))

# # Пример ввода данных

# print('Введите первое значение: ')
# a = input()
# print("Полученный результат: ", a)

# b = input('Введите второе число: ')
# c = ("Полученный результат: ")
# print(c, b)

# # Сумма нескольких чисел

# print(a,'+',b,'+','=', a + b) # Вданном случае не происходит сложение чисел, а сложение строк

# c = 5.55

# print(c)
# print(type(c))

# j = int(c) # Приведение переменной к целочисленному значению

# print(j)
# print(type(j))

# j = str(c) # Приведение переменной к значению строки

# print(j)
# print(type(j))


# j = bool(c) # Приведение переменной к значению высказывания

# print(j)
# print(type(j))

# # Проба сложения с тим переменных int
# print('Введите первое значение: ')
# a = int(input())
# print("Полученный результат: ", a)
# b = int(input('Введите второе число: '))
# print('Результат сложения: ',a,'+',b,'=', a + b)


# Арифметические операции
a = 5.2345455
b = 3.4543333111

print(round(a*b, 4)) # Функция для ограничения символов после запятой