# Задача №2. Найдите сумму цифр трехзначного числа

num = str(input('Введите трехзначное число: '))

print('Сумма цифр из введенного числа = ', int(num[0]) + int(num[1]) + int(num[2]))